# Напишите функцию, создающую(возвращающую) список заданной длины заполненный
# произвольными целыми числами в заданном диапазоне.
# , где size - размер генерируемого списка c элементами в диапазоне от of до to.
import random


def gen_list(size, of, to):
    mas = [random.randint(of, to) for i in range(size)]
    return mas


print(gen_list(10, - 100, 100))
