# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

new_names = ', '.join(names)
print(new_names)

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
